saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/NXP.MKL43Z4_DFP.11.0.0.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dmamux" Cversion="2.0.2" condition="device.MKL43Z4_AND_driver.common">
      <description>DMAMUX Driver</description>
      <files>
        <file category="header" name="drivers/fsl_dmamux.h"/>
        <file category="sourceC" name="drivers/fsl_dmamux.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dma" Cversion="2.0.1" condition="device.MKL43Z4_AND_driver.common_AND_driver.dmamux">
      <description>DMA Driver</description>
      <files>
        <file category="header" name="drivers/fsl_dma.h"/>
        <file category="sourceC" name="drivers/fsl_dma.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dac" Cversion="2.0.1" condition="device.MKL43Z4_AND_driver.common">
      <description>DAC Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_dac.c"/>
        <file category="header" name="drivers/fsl_dac.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="cop" Cversion="2.0.0" condition="device.MKL43Z4_AND_driver.common">
      <description>COP Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_cop.c"/>
        <file category="header" name="drivers/fsl_cop.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="cmp" Cversion="2.0.0" condition="device.MKL43Z4_AND_driver.common">
      <description>CMP Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_cmp.c"/>
        <file category="header" name="drivers/fsl_cmp.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="clock" Cversion="2.1.0" condition="device.MKL43Z4_AND_driver.common">
      <description>Clock Driver</description>
      <files>
        <file category="header" name="drivers/fsl_clock.h"/>
        <file category="sourceC" name="drivers/fsl_clock.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="adc" Cversion="2.0.0" condition="device.MKL43Z4_AND_driver.common">
      <description>ADC16 Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_adc16.c"/>
        <file category="header" name="drivers/fsl_adc16.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="common" Cversion="2.0.1" condition="device.MKL43Z4_AND_device.MKL43Z4_CMSIS_AND_driver.clock">
      <description>COMMON Driver</description>
      <files>
        <file category="header" name="drivers/fsl_common.h"/>
        <file category="sourceC" name="drivers/fsl_common.c"/>
      </files>
    </component>
    <component Cclass="Board Support" Cgroup="SDK Project Template" Csub="project_template" Cvariant="MKL43Z4" Cversion="1.0.0" condition="device.MKL43Z4_AND_component.lpuart_adapter_AND_component.serial_manager_uart_AND_device.MKL43Z4_startup_AND_driver.clock_AND_driver.common_AND_driver.gpio_AND_driver.lpuart_AND_driver.port_AND_driver.smc_AND_utility.debug_console" isDefaultVariant="1">
      <description/>
      <files>
        <file category="header" attr="config" name="project_template/board.h"/>
        <file category="sourceC" attr="config" name="project_template/board.c"/>
        <file category="header" attr="config" name="project_template/clock_config.h"/>
        <file category="sourceC" attr="config" name="project_template/clock_config.c"/>
        <file category="header" attr="config" name="project_template/pin_mux.h"/>
        <file category="sourceC" attr="config" name="project_template/pin_mux.c"/>
        <file category="header" attr="config" name="project_template/peripherals.h"/>
        <file category="sourceC" attr="config" name="project_template/peripherals.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Csub="MKL43Z4_startup" Cversion="1.0.0" condition="device.MKL43Z4_AND_CMSIS_Include_core_cm0plus">
      <description/>
      <files>
        <file condition="iar" category="sourceAsm" attr="config" name="iar/startup_MKL43Z4.s"/>
        <file condition="mdk" category="sourceAsm" attr="config" name="arm/startup_MKL43Z4.s"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/MKL43Z128xxx4_flash.scf"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/MKL43Z128xxx4_ram.scf"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/MKL43Z256xxx4_flash.scf"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/MKL43Z256xxx4_ram.scf"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/MKL43Z128xxx4_flash.icf"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/MKL43Z128xxx4_ram.icf"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/MKL43Z256xxx4_flash.icf"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/MKL43Z256xxx4_ram.icf"/>
        <file category="header" attr="config" name="fsl_device_registers.h"/>
        <file category="header" attr="config" name="MKL43Z4.h"/>
        <file category="header" attr="config" name="MKL43Z4_features.h"/>
        <file category="sourceC" attr="config" name="system_MKL43Z4.c"/>
        <file category="header" attr="config" name="system_MKL43Z4.h"/>
      </files>
    </component>
  </components>
</package>
